//=============================================================================
//
// 背景処理 [bg.h]
// Author : 
//
//=============================================================================
#pragma once

// マクロ定義
#define BG_SIZE_W			(800)	// テクスチャサイズ
#define BG_SIZE_H			(600)	// 同上
#define BG_POS_X			(0)		// ポリゴンの初期位置X(左上)
#define BG_POS_Y			(0)		// 同上

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBG(int type);
void UninitBG(void);
void UpdateBG(void);
void DrawBG(void);

